**Titanic**  
머신러닝을 사용하지 않고 데이터를 보고 pandas로 생존여부 데이터 직접 채우기

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['train.csv', 'gender_submission.csv', 'test.csv']

### **1. 데이터 불러오기**

In [2]:
train = pd.read_csv('../input/train.csv')
test = pd.read_csv('../input/test.csv')
print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [3]:
# 첫 5행을 보여줌
train.head()

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
test.head()

   PassengerId  Pclass   ...    Cabin Embarked
0          892       3   ...      NaN        Q
1          893       3   ...      NaN        S
2          894       2   ...      NaN        Q
3          895       3   ...      NaN        S
4          896       3   ...      NaN        S

[5 rows x 11 columns]

### **2. 데이터를 요약**

In [5]:
# 간단한 통계 정보를 보여줌
# 데이터의 개수(count), 평균값(mean), 표준편차(std), 최소값(min), 사분위수(25%,50%,70%), 최대값(max)          
train.describe()

       PassengerId    Survived     ...           Parch        Fare
count   891.000000  891.000000     ...      891.000000  891.000000
mean    446.000000    0.383838     ...        0.381594   32.204208
std     257.353842    0.486592     ...        0.806057   49.693429
min       1.000000    0.000000     ...        0.000000    0.000000
25%     223.500000    0.000000     ...        0.000000    7.910400
50%     446.000000    0.000000     ...        0.000000   14.454200
75%     668.500000    1.000000     ...        0.000000   31.000000
max     891.000000    1.000000     ...        6.000000  512.329200

[8 rows x 7 columns]

In [6]:
test.describe()

       PassengerId      Pclass     ...           Parch        Fare
count   418.000000  418.000000     ...      418.000000  417.000000
mean   1100.500000    2.265550     ...        0.392344   35.627188
std     120.810458    0.841838     ...        0.981429   55.907576
min     892.000000    1.000000     ...        0.000000    0.000000
25%     996.250000    1.000000     ...        0.000000    7.895800
50%    1100.500000    3.000000     ...        0.000000   14.454200
75%    1204.750000    3.000000     ...        0.000000   31.500000
max    1309.000000    3.000000     ...        9.000000  512.329200

[8 rows x 6 columns]

In [7]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

### **3. 성별에 따른 생존률 **

In [8]:
# 생존여부가 1, 0으로 표시되어 있기에 평균을 구하면 생존률을 구할 수 있다.
train.groupby('Sex')[['Survived']].mean()

        Survived
Sex
female  0.742038
male    0.188908

In [9]:
# aggfunc : 분석 메소드
train.pivot_table(values=['Survived'], index=['Sex'],aggfunc=np.mean)

        Survived
Sex
female  0.742038
male    0.188908

In [10]:
train.pivot_table(index=['Sex'])

              Age       Fare     Parch    ...       Pclass     SibSp  Survived
Sex                                       ...
female  27.915709  44.479818  0.649682    ...     2.159236  0.694268  0.742038
male    30.726645  25.523893  0.235702    ...     2.389948  0.429809  0.188908

[2 rows x 7 columns]

In [11]:
# 사분위수는 의미 없음. groupby한 것에 describe를 사용해서 분석
train.groupby('Sex')[['Survived']].describe()

       Survived
          count      mean       std  min  25%  50%  75%  max
Sex
female    314.0  0.742038  0.438211  0.0  0.0  1.0  1.0  1.0
male      577.0  0.188908  0.391775  0.0  0.0  0.0  0.0  1.0

In [12]:
# Sex, Pclass별 생존률
train.groupby(['Sex','Pclass'])[['Survived']].mean()

               Survived
Sex    Pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

### **4. 여성인 경우 생존했다고 가정하고 데이터 처리**

In [13]:
# 여성인 경우 생존했다고 가정하고 test의 Survived 데이터를 채움
test['Survived'] = (test.Sex == 'female') & (test.Age > 0) & (test.Embarked)

In [14]:
test.head()

   PassengerId  Pclass   ...    Embarked Survived
0          892       3   ...           Q    False
1          893       3   ...           S     True
2          894       2   ...           Q    False
3          895       3   ...           S    False
4          896       3   ...           S     True

[5 rows x 12 columns]

In [15]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Survived         0
dtype: int64

In [16]:
test['Survived'].value_counts()

False    291
True     127
Name: Survived, dtype: int64

### **5. 데이터 프레임 복사**

In [17]:
submission = test[['PassengerId','Survived']].copy()

In [18]:
submission.head()

   PassengerId  Survived
0          892     False
1          893      True
2          894     False
3          895     False
4          896      True

### **6. 제출 형태에 맞는 데이터 타입으로 변경**

In [19]:
submission['Survived'] = submission['Survived'].astype(int)

In [20]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

### **7. csv 형태로 파일 변환**

In [21]:
# %mkdir submissions
submission.to_csv('submission.csv', index=False)